#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repository_nuxt_web["hangar"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "web-hangar"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "web-hangar"
    }

  # module.repository_nuxt_web["hangar"].github_branch_protection.all["*"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "web-hangar"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_nuxt_web["hangar"].github_branch_protection.all["**/**"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "**/**"
      + repository_id                   = "web-hangar"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_nuxt_web["hangar"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "web-hangar"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_nuxt_web["hangar"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "web-hangar"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_nuxt_web["hangar"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = false
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrow Web Application - Asset management and administration UI"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "web-hangar"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + template {
          + include_all_branches = false
          + owner                = "Arrow-air"
          + repository           = "web-template-nuxt"
        }
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".commitlintrc.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.commitlintrc.yml
            
            rules:
              body-leading-blank: [1, always]
              body-max-line-length: [2, always, 100]
              footer-leading-blank: [1, always]
              footer-max-line-length: [2, always, 100]
              header-max-length: [2, always, 100]
              subject-case:
                - 2
                - never
                - [sentence-case, start-case, pascal-case, upper-case]
              subject-empty: [2, never]
              subject-full-stop: [2, never, "."]
              type-case: [2, always, lower-case]
              type-empty: [2, never]
              type-enum:
                - 2
                - always
                - [build, chore, ci, docs, feat, fix, perf, refactor, revert, style, test]
        EOT
      + file                = ".commitlintrc.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.cspell.config.yaml
            
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignoreRegExp:
              - '\..*'
            ignorePaths:
              - 'node_modules'
              - 'build'
              - '*.css'
              - '*.svg'
              - '*/**Makefile'
              - 'target'
              - 'out'
              - 'coverage'
              - 'src/*.plan'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [{*.md,*.mdx,LICENSE*}]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.rs]
            trim_trailing_whitespace = false
            indent_style = space
            indent_size = 4
            [{Makefile*,*.mk,*.sh}]
            indent_style = tab
            indent_size = 4
            [{*.tsx,*.html,*.yml,*.yaml,*.toml,*.json,*.tf,*.hcl}]
            indent_size = 2
            # we might want to use https://www.npmjs.com/package/lintspaces instead, we can't lint the css and js comments atm
            [{*.js,*.css,Cargo.lock}]
            indent_size = unset
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/webdevelopers
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.github/workflows/sanity_checks.yml
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              cspell:
                name: Spelling Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
            
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make md-test-links
            
              commit-msg:
                name: Commit message Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      fetch-depth: 0
                  - run: npx commitlint --from=${{ github.event.pull_request.base.sha }}
            
              release-notes:
                name: Preview Release Notes
                runs-on: ubuntu-latest
                steps:
                  - name: Checkout Code
                    uses: actions/checkout@v3
                    with:
                      fetch-depth: 0
            
                  - name: Generate Changelog
                    id: changelog
                    uses: mrchief/universal-changelog-action@v1.3.1
                    with:
                      previousReleaseTagNameOrSha: ${{ github.event.pull_request.base.sha }}
                      nextReleaseTagName: ${{ github.sha }}
                      nextReleaseName: "Release ${{ steps.tag_version.outputs.new_version }}"
            
                  - name: Add PR Comment with Changelog Output
                    uses: thollander/actions-comment-pull-request@v1
                    continue-on-error: true
                    with:
                      message: |
                        <details>
                        <summary>This PR will generate the following release notes when merged:</summary>
            
                        ${{ steps.changelog.outputs.changelog }}
            
                        </details>
                      comment_includes: 'This PR will generate the following release notes when merged'
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.gitignore
            
            # Dependencies
            node_modules
            
            # Nuxt build and generate output dirs
            .nuxt
            dist
            
            # Logs
            npm-debug.log*
            yarn-debug.log*
            yarn-error.log*
            
            # Don't add vscode or idea meta files
            .vscode
            .idea
            
            # Don't add DS_Store
            .DS_Store
            
            # env
            .env
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".husky/commit-msg"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.husky/hooks/commit-msg
            . "$(dirname -- "$0")/_/husky.sh"
            
            export COMMITLINT_CHECK=${1}
            make commitlint-test
        EOT
      + file                = ".husky/commit-msg"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".husky/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.husky/hooks/pre-commit
            . "$(dirname -- "$0")/_/husky.sh"
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            NC=$(tput setaf 9)
            BOLD=$(tput bold)
            SGR0=$(tput sgr0)
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${SGR0}"
            
            set -e
            
            # Tests
            make test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${SGR0}"
        EOT
      + file                = ".husky/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".make/base.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/base.mk
            
            SHELL := /bin/bash
            
            SANITYCHECKS_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-sanitychecks
            SANITYCHECKS_IMAGE_TAG  := 0.2
            
            SOURCE_PATH      ?= $(PWD)
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	$(2) \
            	-t $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG) \
            	$(1)
            
            .SILENT: *docker-pull
            
            .help-base:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(SGR0)"
            
            docker-pull:
            	@echo docker pull -q $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG)
        EOT
      + file                = ".make/base.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".make/commitlint.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/commitlint.mk
            
            COMMITLINT_CHECK :=
            
            .help-commitlint:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Commitlint$(SGR0)"
            	@echo "  $(BOLD)commitlint-test$(SGR0)  -- Run 'commitlint --edit $(COMMITLINT_CHECK)'"
            	@echo "                      to validate commit messages are following the conventional commit standards."
            
            commitlint-test: docker-pull
            	@echo "$(CYAN)Checking for commit message errors...$(SGR0)"
            	@$(call docker_run,commitlint --edit $(COMMITLINT_CHECK))
        EOT
      + file                = ".make/commitlint.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".make/cspell.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/cspell.mk
            CSPELL_PROJECT_WORDS ?= .cspell.project-words.txt
            
            .help-cspell:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0)      -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                      to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            
            cspell-test: docker-pull
            ifeq ("$(wildcard $(CSPELL_PROJECT_WORDS))","")
            	@echo "$(YELLOW)No $(CSPELL_PROJECT_WORDS) found, creating...$(SGR0)"
            	touch $(CSPELL_PROJECT_WORDS)
            endif
            	@echo "$(CYAN)Checking for spelling errors...$(SGR0)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            cspell-add-words: docker-pull
            	@echo "$(CYAN)Adding words to the project's cspell word list...$(SGR0)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
        EOT
      + file                = ".make/cspell.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".make/editorconfig.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/editorconfig.mk
            
            .help-editorconfig:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Editorconfig$(SGR0)"
            	@echo "  $(BOLD)editorconfig-test$(SGR0) -- Run editorconfig test to validate all file formats are valid"
            	@echo "  $(BOLD)editorconfig-tidy$(SGR0) -- Run editorconfig tidy to fix all file formats if needed"
            
            editorconfig-test:
            	@echo "$(CYAN)Checking if the codebase is compliant with the .editorconfig file...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            editorconfig-tidy: docker-pull
            	@echo "$(CYAN)Running editorconfig formatting fixes...$(SGR0)"
            	@$(call docker_run,sh -c 'eclint fix .')
        EOT
      + file                = ".make/editorconfig.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files[".make/markdown.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/markdown.mk
            
            MARKDOWN_FILES ?= $(shell find . -type f -iname '*md' ! -iwholename "*./node_modules/*" ! -path "./build" ! -iwholename "*.terraform*" ! -iwholename "*.cargo/*")
            LINK_CHECKER_JSON ?= .link-checker.config.json
            
            .help-markdown:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Markdown$(SGR0)"
            	@echo "  $(BOLD)md-test-links$(SGR0)   -- Run markdown-link-check on all markdown files to catch dead links."
            
            md-test-links:
            ifeq ("$(MARKDOWN_FILES)", "")
            	@echo "$(YELLOW)No markdown files found, skipping link validation...$(SGR0)"
            else
            ifeq ("$(wildcard $(LINK_CHECKER_JSON))","")
            	@echo "$(YELLOW)No $(LINK_CHECKER_JSON) found, creating...$(SGR0)"
            	echo -e "{\n}\n" > $(LINK_CHECKER_JSON)
            endif
            	@echo "$(CYAN)Checking if all document links are valid...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/tcort/markdown-link-check:3.10 \
            		-c $(LINK_CHECKER_JSON) $(MARKDOWN_FILES)
            endif
        EOT
      + file                = ".make/markdown.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files["CONTRIBUTING.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            See [Contributing Guide](https://www.arrowair.com/docs/contributing/intro)  on Arrow website.
        EOT
      + file                = "CONTRIBUTING.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
            DOCKER_NAME := arrow-web-hangar
            
            help: .help-base .help-cspell .help-markdown .help-editorconfig
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_file.init will be created
  + resource "github_repository_file" "init" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT REMOVE
            This repository is managed by Terraform and contains files that will be overwritten when changed
            This file is part of the management of repository web-hangar
        EOT
      + file                = ".terraform_init"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "web-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["hangar"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "web-hangar"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_nuxt_web["hangar"].github_team_repository.maintainer["webdevelopers"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "web-hangar"
      + team_id    = "webdevelopers"
    }

Plan: 25 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*